# FireProtection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..FireProtection Property
GroupTypeId Class See Also
---
Fire Protection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId FireProtection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FireProtection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FireProtection {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace